; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v12 ?v8)
             (pred_11 ?v7 ?v1)
             (pred_4 ?v12 ?v1)
             (pred_5 ?v11 ?v12 )
	     (pred_8 ?v12)
             (pred_12 ?v13)
             (pred_6 ?v7)
             (pred_9 ?v1)
             (pred_2 ?v12)
             (pred_7 ?v7)
             (pred_3 ?v12)
             (pred_1 ))



(:action op_3
:parameters (?v5 ?v9 ?v2 ?v10)
:precondition (and (pred_12 ?v5) (pred_12 ?v9) (pred_6 ?v2) (pred_9 ?v10)
          (pred_10 ?v5 ?v9) (pred_11 ?v2 ?v10)
                   (pred_4 ?v9 ?v10) (pred_8 ?v5) 
                   (pred_2 ?v9) (pred_7 ?v2))
:effect (and  (pred_3 ?v9) (not (pred_2 ?v9))))


(:action op_4
:parameters (?v5 ?v3)
:precondition (and (pred_12 ?v5) (pred_12 ?v3)
               (pred_8 ?v5) (pred_10 ?v5 ?v3) (pred_3 ?v3))
:effect (and (pred_8 ?v3) (not (pred_8 ?v5))))

(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_12 ?v5) (pred_6 ?v2) 
                  (pred_8 ?v5) (pred_5 ?v2 ?v5) (pred_1 ))
:effect (and (pred_7 ?v2)
   (not (pred_5 ?v2 ?v5)) (not (pred_1 ))))


(:action op_5
:parameters (?v5 ?v6 ?v4)
:precondition (and (pred_12 ?v5) (pred_6 ?v6) (pred_6 ?v4)
                  (pred_8 ?v5) (pred_7 ?v4) (pred_5 ?v6 ?v5))
:effect (and (pred_7 ?v6) (pred_5 ?v4 ?v5)
        (not (pred_7 ?v4)) (not (pred_5 ?v6 ?v5))))

(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_12 ?v5) (pred_6 ?v2) 
                  (pred_8 ?v5) (pred_7 ?v2))
:effect (and (pred_1 ) (pred_5 ?v2 ?v5) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_09 obj_08 obj_13 obj_11 obj_17 obj_07 obj_18 obj_05 obj_01 obj_15 obj_20 obj_03 obj_04 obj_12 obj_16
    obj_14 obj_02
    obj_10 obj_19
    )

    (:init
       (pred_1)

       (pred_12 obj_06)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_18)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_12 obj_12)
       (pred_12 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_19)

       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_07 obj_15)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_01)
       (pred_10 obj_05 obj_11)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_05)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_15)
       (pred_4  obj_03 obj_14)
       (pred_4  obj_15 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_16)

       (pred_11  obj_10 obj_14)
       (pred_11  obj_19 obj_02)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_19 obj_09)
       (pred_8 obj_17)
    )

    (:goal (and
       (pred_5 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_04)))
)
)

; plan
1. (op_4 obj_17 obj_07)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_18)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_20)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_20)
   goals met: 0 of 1
4. (op_2 obj_20 obj_10)
   deleted: (pred_5 obj_10 obj_20) (pred_1)
   added: (pred_7 obj_10)
   goals met: 0 of 1
5. (op_4 obj_20 obj_18)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_07)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_17)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_17)
   goals met: 0 of 1
8. (op_4 obj_17 obj_11)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_05)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_05)
   goals met: 0 of 1
10. (op_3 obj_05 obj_03 obj_10 obj_14)
   deleted: (pred_2 obj_03)
   added: (pred_3 obj_03)
   goals met: 0 of 1
11. (op_4 obj_05 obj_03)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_03)
   goals met: 0 of 1
12. (op_1 obj_03 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_1) (pred_5 obj_10 obj_03)
   goals met: 1 of 1
